# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [3]:
series1 = pd.Series(np.random.randint(1,4,100), name='Series1')
series2 = pd.Series(np.random.randint(1,3,100), name='Series2')
series3 = pd.Series(np.random.randint(10000,30000,100), name='Series3')

### Step 3. Let's create a DataFrame by joining the Series by column

In [5]:
df = pd.concat([series1, series2, series3], axis=1)
print(df.shape)
print(df.head())

(100, 3)
   Series1  Series2  Series3
0        2        1    28519
1        2        1    22544
2        1        1    20206
3        2        1    22237
4        1        2    23189

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [10]:
df.rename(columns = {
    'Series1' : 'bedrs',
    'Series2' : 'bathrs',
    'Series3' : 'price_sqr_meter',
})

    bedrs  bathrs  price_sqr_meter
0       2       1            28519
1       2       1            22544
2       1       1            20206
3       2       1            22237
4       1       2            23189
..    ...     ...              ...
95      2       1            12172
96      3       1            22752
97      1       2            29914
98      1       1            18719
99      2       2            14438

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [43]:
one_col_df = pd.concat([series1,series2,series3])
bigcolumn = pd.DataFrame(one_col_df)
bigcolumn.shape

(300, 1)

### Step 6. Ops it seems it is going only until index 99. Is it true?

In [44]:
bigcolumn.head()

   0
0  2
1  2
2  1
3  2
4  1

In [56]:
bigcolumn.iloc[95:105]

    0
95  2
96  3
97  1
98  1
99  2
0   1
1   1
2   1
3   1
4   2

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [58]:
bigcolumn = bigcolumn.set_index(np.arange(0,300))

In [59]:
bigcolumn.head()

   0
0  2
1  2
2  1
3  2
4  1

In [60]:
bigcolumn.tail()

         0
295  12172
296  22752
297  29914
298  18719
299  14438